# Рефлексия задач задания 10:

# 4. Метод, реализующий декартово произведение множеств.
# Задание выполнено верно

# 6. Реализуйте мульти-множество (Bag), в котором каждый элемент может присутствовать несколько раз.
# Задание выполнено верно

# Рефлексия задач задания 11:

# 2. Алгоритм слияния нескольких фильтров Блюма.
# Задание выполнено верно

# 3. Фильтр Блюма, предусматривающий удаление элементов.
# Задание выполнено верно

# 4. Восстановить исходное множество
# Из предложенных вариантов под правильный подходит первый вариант, который подходит под брутфорс.
